n = int(input("Введите общее количество журавликов: "))

# Рассчитайте количество журавликов, сделанных каждым ребенком

petya = n // 6

katya = 4 * petya

serezha = petya

# Выведите количество журавликов, сделанных Петей, Катей и Сережей

print(f"Петя: {petya}, Катя: {katya}, Сережа: {serezha}")
